//CHASSIS LIST FOR REFERENCE AND USE
/*
"ZN6":	"",	//	86
"NCP30":	"",	//	bB
"NCP30":	"",	//	BB
"NCP31":	"",	//	BB
"NCP35":	"",	//	BB
"QNC20":	"",	//	BB
"QNC21":	"",	//	BB
"QNC25":	"",	//	BB
"NGX50":	"",	//	C-HR
"ZYX10":	"",	//	C-HR
"ZWA10":	"",	//	CT
"GSJ15W":	"",	//	FJｸﾙｰｻﾞｰ
"AWL10":	"",	//	GS
"GRL10":	"",	//	GS
"GRL11":	"",	//	GS
"GRS191":	"",	//	GS
"GWL10":	"",	//	GS
"GWS191":	"",	//	GS
"UZS190":	"",	//	GS
"VCH10W":	"",	//	Gﾊｲｴｰｽ
"VCH16W":	"",	//	Gﾊｲｴｰｽ
"ANF10":	"",	//	HS
"KGJ10":	"",	//	iQ
"KGJ10":	"",	//	IQ
"NGJ10":	"",	//	iQ
"AVE30":	"",	//	IS
"GSE21":	"",	//	IS
"GSE30":	"",	//	IS
"USF40":	"",	//	LS
"USF45":	"",	//	LS
"UVF45":	"",	//	LS
"UVF46":	"",	//	LS
"ZZW30":	"",	//	MR-S
"SW20ｶｲ":	"",	//	MR2
"AGZ10":	"",	//	NX
"ACA21W":	"",	//	RAV4
"ACA31W":	"",	//	RAV4
"ACA36W":	"",	//	RAV4
"SXA16G":	"",	//	RAV4
"ZCA25W":	"",	//	RAV4
"ZCA26W":	"",	//	RAV4
"ACA21W":	"",	//	RAV4 L
"SXA11G":	"",	//	RAV4 L
"SXA10G":	"",	//	RAV4J
"AVC10":	"",	//	RC
"GSC10":	"",	//	RC
"-GYL10W-":	"",	//	RX
"AGL10W":	"",	//	RX
"AGL25W":	"",	//	RX
"GYL10W":	"",	//	RX
"GYL15W":	"",	//	RX
"AZK10":	"",	//	SAI
"UZZ40":	"",	//	SC
"NCP19":	"",	//	WILL VI
"NZE127":	"",	//	WILL VS
"NZE127":	"",	//	WILL VS
"ZZE127":	"",	//	WILL VS
"ZZE127":	"",	//	WiLL VS
"NCP70":	"",	//	WiLL ｻｲﾌｧ
"ANM10G":	"",	//	ｱｲｼｽ
"ANM10W":	"",	//	ｱｲｼｽ
"ANM15G":	"",	//	ｱｲｼｽ
"ANM15W":	"",	//	ｱｲｼｽ
"ZGM10G":	"",	//	ｱｲｼｽ
"ZGM10W":	"",	//	ｱｲｼｽ
"ZGM11W":	"",	//	ｱｲｼｽ
"ZGM15W":	"",	//	ｱｲｼｽ
"ZNM10G":	"",	//	ｱｲｼｽ
"ZNM10W":	"",	//	ｱｲｼｽ
"NZE141":	"",	//	ｱｸｼｵ
"MCX10":	"",	//	ｱﾊﾞﾛﾝ
"AZT251W":	"",	//	ｱﾍﾞﾝｼｽ
"AZT255W":	"",	//	ｱﾍﾞﾝｼｽ
"ZRT272W":	"",	//	ｱﾍﾞﾝｼｽ
"AZT250W":	"",	//	ｱﾍﾞﾝｼｽW
"AZT250":	"",	//	ｱﾍﾞﾝｼｽｾﾀﾞﾝ
"AZT251":	"",	//	ｱﾍﾞﾝｼｽｾﾀﾞﾝ
"AZT255":	"",	//	ｱﾍﾞﾝｼｽｾﾀﾞﾝ
"AZT250W":	"",	//	ｱﾍﾞﾝｼｽﾜｺﾞﾝ
"AZT251W":	"",	//	ｱﾍﾞﾝｼｽﾜｺﾞﾝ
"ZRT272W":	"",	//	ｱﾍﾞﾝｼｽﾜｺﾞﾝ
"AZT240":	"",	//	ｱﾘｵﾝ
"NZT240":	"",	//	ｱﾘｵﾝ
"NZT260":	"",	//	ｱﾘｵﾝ
"ZRT260":	"",	//	ｱﾘｵﾝ
"ZRT261":	"",	//	ｱﾘｵﾝ
"ZZT240":	"",	//	ｱﾘｵﾝ
"ZZT245":	"",	//	ｱﾘｵﾝ
"JZS160":	"",	//	ｱﾘｽﾄ
"JZS160":	"",	//	ｱﾘｽﾄ
"JZS161":	"",	//	ｱﾘｽﾄ
"GXE10":	"",	//	ｱﾙﾃｯﾂｧ
"SXE10":	"",	//	ｱﾙﾃｯﾂｧ
"GXE10W":	"",	//	ｱﾙﾃｯﾂｧｼﾞｰﾀ
"AGH30W":	"",	//	ｱﾙﾌｧｰﾄﾞ
"ANH10W":	"",	//	ｱﾙﾌｧｰﾄﾞ
"ANH15W":	"",	//	ｱﾙﾌｧｰﾄﾞ
"ANH20W":	"",	//	ｱﾙﾌｧｰﾄﾞ
"ANH25W":	"",	//	ｱﾙﾌｧｰﾄﾞ
"ATH20W":	"",	//	ｱﾙﾌｧｰﾄﾞ
"GGH20W":	"",	//	ｱﾙﾌｧｰﾄﾞ
"GGH25W":	"",	//	ｱﾙﾌｧｰﾄﾞ
"MNH10W":	"",	//	ｱﾙﾌｧｰﾄﾞ
"MNH15W":	"",	//	ｱﾙﾌｧｰﾄﾞ
"ANH10W":	"",	//	ｱﾙﾌｧｰﾄﾞG
"ANH15W":	"",	//	ｱﾙﾌｧｰﾄﾞG
"MNH10W":	"",	//	ｱﾙﾌｧｰﾄﾞG
"ANH15W":	"",	//	ｱﾙﾌｧｰﾄﾞG/V
"ATH10W":	"",	//	ｱﾙﾌｧｰﾄﾞHV
"ANH10W":	"",	//	ｱﾙﾌｧｰﾄﾞV
"ANH15W":	"",	//	ｱﾙﾌｧｰﾄﾞV
"MNH10W":	"",	//	ｱﾙﾌｧｰﾄﾞV
"MNH15W":	"",	//	ｱﾙﾌｧｰﾄﾞV
"ATH10W":	"",	//	ｱﾙﾌｧｰﾄﾞﾊｲﾌﾞﾘｯﾄﾞ
"ATH20W":	"",	//	ｱﾙﾌｧｰﾄﾞﾊｲﾌﾞﾘｯﾄﾞ
"AYH30W":	"",	//	ｱﾙﾌｧｰﾄﾞﾊｲﾌﾞﾘｯﾄﾞ
"NZE121":	"",	//	ｱﾚｯｸｽ
"ZZE123":	"",	//	ｱﾚｯｸｽ
"NCP110":	"",	//	ｲｽﾄ
"NCP60":	"",	//	ｲｽﾄ
"NCP61":	"",	//	ｲｽﾄ
"NCP65":	"",	//	ｲｽﾄ
"ZSP110":	"",	//	ｲｽﾄ
"ACM21W":	"",	//	ｲﾌﾟｻﾑ
"ACM26W":	"",	//	ｲﾌﾟｻﾑ
"SXM10G":	"",	//	ｲﾌﾟｻﾑ
"SXM15G":	"",	//	ｲﾌﾟｻﾑ
"ACA33W":	"",	//	ｳﾞｧﾝｶﾞｰﾄﾞ
"ACA38W":	"",	//	ｳﾞｧﾝｶﾞｰﾄﾞ
"ANE10G":	"",	//	ｳｲｯｼｭ
"ANE10G":	"",	//	ｳｨｯｼｭ
"ANE11W":	"",	//	ｳｨｯｼｭ
"ANE11W":	"",	//	ｳｲｯｼｭ
"ZGE20G":	"",	//	ｳｨｯｼｭ
"ZGE20G":	"",	//	ｳｲｯｼｭ
"ZGE20W":	"",	//	ｳｲｯｼｭ
"ZGE20W":	"",	//	ｳｨｯｼｭ
"ZGE22W":	"",	//	ｳｲｯｼｭ
"ZGE25G":	"",	//	ｳｨｯｼｭ
"ZGE25W":	"",	//	ｳｨｯｼｭ
"ZNE10G":	"",	//	ｳｨｯｼｭ
"ZNE10G":	"",	//	ｳｲｯｼｭ
"ZNE14G":	"",	//	ｳｨｯｼｭ
"ZNE14G":	"",	//	ｳｲｯｼｭ
"KSP130":	"",	//	ｳﾞｨｯﾂ
"NCP10":	"",	//	ｳﾞｨｯﾂ
"NCP13":	"",	//	ｳﾞｨｯﾂ
"NCP131":	"",	//	ｳﾞｨｯﾂ
"NCP15":	"",	//	ｳﾞｨｯﾂ
"NCP91":	"",	//	ｳﾞｨｯﾂ
"NCP95":	"",	//	ｳﾞｨｯﾂ
"NSP130":	"",	//	ｳﾞｨｯﾂ
"SCP13":	"",	//	ｳﾞｨｯﾂ
"SCP90":	"",	//	ｳﾞｨｯﾂ
"SKP130":	"",	//	ｳﾞｨｯﾂ
"NCP15":	"",	//	ｳﾞｨｯﾂ 3HB
"MCV21":	"",	//	ｳｨﾝﾀﾞﾑ
"AGH30W":	"",	//	ｳﾞｪﾙﾌｧｲｱ
"ANH20W":	"",	//	ｳﾞｪﾙﾌｧｲｱ
"ANH25W":	"",	//	ｳﾞｪﾙﾌｧｲｱ
"ATH20W":	"",	//	ｳﾞｪﾙﾌｧｲｱ
"GGH20W":	"",	//	ｳﾞｪﾙﾌｧｲｱ
"GGH25W":	"",	//	ｳﾞｪﾙﾌｧｲｱ
"GGH30W":	"",	//	ｳﾞｪﾙﾌｧｲｱ
"ATH20W":	"",	//	ｳﾞｪﾙﾌｧｲｱﾊｲﾌﾞﾘｯﾄﾞ
"GX115":	"",	//	ｳﾞｪﾛｯｻ
"AZR60G":	"",	//	ｳﾞｫｸｼｰ
"AZR65G":	"",	//	ｳﾞｫｸｼｰ
"ZRR70G":	"",	//	ｳﾞｫｸｼｰ
"ZRR70W":	"",	//	ｳﾞｫｸｼｰ
"ZRR75W":	"",	//	ｳﾞｫｸｼｰ
"ZRR80G":	"",	//	ｳﾞｫｸｼｰ
"ZRR80W":	"",	//	ｳﾞｫｸｼｰ
"ZWR80G":	"",	//	ｳﾞｫｸｼｰ
"ZWR80W":	"",	//	ｳﾞｫｸｼｰ
"ZZE136":	"",	//	ｳﾞｫﾙﾂ
"ZZE137":	"",	//	ｳﾞｫﾙﾂ
"ZRR80G":	"",	//	ｴｽｸｧｲｱ
"ZWR80G":	"",	//	ｴｽｸｧｲｱ
"ACR30":	"",	//	ｴｽﾃｨﾏ
"ACR30W":	"",	//	ｴｽﾃｨﾏ
"ACR40W":	"",	//	ｴｽﾃｨﾏ
"ACR50W":	"",	//	ｴｽﾃｨﾏ
"ACR55":	"",	//	ｴｽﾃｨﾏ
"ACR55W":	"",	//	ｴｽﾃｨﾏ
"GSR50W":	"",	//	ｴｽﾃｨﾏ
"GSR55W":	"",	//	ｴｽﾃｨﾏ
"MCR30W":	"",	//	ｴｽﾃｨﾏ
"MCR40W":	"",	//	ｴｽﾃｨﾏ
"TCR11W":	"",	//	ｴｽﾃｨﾏ
"AHR20W":	"",	//	ｴｽﾃｨﾏ HV
"ACR30W":	"",	//	ｴｽﾃｨﾏ L
"ACR40W":	"",	//	ｴｽﾃｨﾏ T
"TCR10G":	"",	//	ｴｽﾃｨﾏ･ﾙｼｰﾀﾞ
"AHR10W":	"",	//	ｴｽﾃｨﾏHV
"AHR20W":	"",	//	ｴｽﾃｨﾏHV
"ACR30W":	"",	//	ｴｽﾃｨﾏL
"ACR40W":	"",	//	ｴｽﾃｨﾏL
"MCR30W":	"",	//	ｴｽﾃｨﾏL
"MCR40W":	"",	//	ｴｽﾃｨﾏL
"ACR30W":	"",	//	ｴｽﾃｨﾏT
"ACR40W":	"",	//	ｴｽﾃｨﾏT
"MCR30W":	"",	//	ｴｽﾃｨﾏT
"MCR40W":	"",	//	ｴｽﾃｨﾏT
"MCR40W":	"",	//	ｴｽﾃｨﾏT
"ACR30W":	"",	//	ｴｽﾃｨﾏT/L
"TCR20G":	"",	//	ｴｽﾃｨﾏｴﾐｰﾅ
"AHR10W":	"",	//	ｴｽﾃｨﾏﾊｲﾌﾞﾘｯﾄ
"AHR20W":	"",	//	ｴｽﾃｨﾏﾊｲﾌﾞﾘｯﾄﾞ
"CXR20G":	"",	//	ｴｽﾃｨﾏﾙｼｰﾀﾞ
"CXR20G":	"",	//	ｴｽﾃｨﾏﾙｼｰﾀﾞ
"TCR10G":	"",	//	ｴｽﾃｨﾏﾙｼｰﾀﾞ
"TCR10G":	"",	//	ｴｽﾃｨﾏﾙｼｰﾀﾞ
"ZCT10":	"",	//	ｵｰﾊﾟ
"NZE151H":	"",	//	ｵｰﾘｽ
"NZE181H":	"",	//	ｵｰﾘｽ
"ZRE152H":	"",	//	ｵｰﾘｽ
"ZRE154H":	"",	//	ｵｰﾘｽ
"ACM10G":	"",	//	ｶﾞｲｱ
"SXM10G":	"",	//	ｶﾞｲｱ
"SXM15G":	"",	//	ｶﾞｲｱ
"ACV30":	"",	//	ｶﾑﾘ
"ACV40":	"",	//	ｶﾑﾘ
"ACV45":	"",	//	ｶﾑﾘ
"AVV50":	"",	//	ｶﾑﾘ
"SV40":	"",	//	ｶﾑﾘ
"SV41":	"",	//	ｶﾑﾘ
"ACV35":	"",	//	ｶﾑﾘ SED
"SXV25W":	"",	//	ｶﾑﾘｸﾞﾗｼｱ
"KDY231ｶｲ":	"",	//	ｶﾑﾛｰﾄﾞ
"AT211":	"",	//	ｶﾘｰﾅ
"AT212":	"",	//	ｶﾘｰﾅ
"RA45":	"",	//	ｶﾘｰﾅ
"ST215":	"",	//	ｶﾘｰﾅ
"AE114G":	"",	//	ｶﾘﾌﾞ
"AE115G":	"",	//	ｶﾘﾌﾞ
"AT211G":	"",	//	ｶﾙﾃﾞｨﾅ
"AZT241W":	"",	//	ｶﾙﾃﾞｨﾅ
"AZT246W":	"",	//	ｶﾙﾃﾞｨﾅ
"CT197V":	"",	//	ｶﾙﾃﾞｨﾅ
"ST191G":	"",	//	ｶﾙﾃﾞｨﾅ
"ST215G":	"",	//	ｶﾙﾃﾞｨﾅ
"ST246W":	"",	//	ｶﾙﾃﾞｨﾅ
"ZZT241W":	"",	//	ｶﾙﾃﾞｨﾅ
"CT199V":	"",	//	ｶﾙﾃﾞｨﾅV
"AT211G":	"",	//	ｶﾙﾃﾞｨﾅW
"AZT241W":	"",	//	ｶﾙﾃﾞｨﾅW
"ST210G":	"",	//	ｶﾙﾃﾞｨﾅW
"ST210G":	"",	//	ｶﾙﾃﾞｨﾅW
"AZT241W":	"",	//	ｶﾙﾃﾞｨﾅﾜｺﾞﾝ
"AE114":	"",	//	ｶﾛｰﾗ
"EE101":	"",	//	ｶﾛｰﾗ
"EE103V":	"",	//	ｶﾛｰﾗ
"EE111":	"",	//	ｶﾛｰﾗ
"NZE120":	"",	//	ｶﾛｰﾗ
"NZE121":	"",	//	ｶﾛｰﾗ
"NZE124":	"",	//	ｶﾛｰﾗ
"ZZE122":	"",	//	ｶﾛｰﾗ
"ZZE124":	"",	//	ｶﾛｰﾗ
"AE114":	"",	//	ｶﾛｰﾗ SED
"NZE141":	"",	//	ｶﾛｰﾗ ｱｸｼｵ
"NZE144":	"",	//	ｶﾛｰﾗ ｱｸｼｵ
"NZE161":	"",	//	ｶﾛｰﾗ ｱｸｼｵ
"NZE164":	"",	//	ｶﾛｰﾗ ｱｸｼｵ
"ZZE124N":	"",	//	ｶﾛｰﾗ ｽﾊﾟｼｵ
"NZE141G":	"",	//	ｶﾛｰﾗ ﾌｨｰﾙﾀﾞｰ
"NZE144G":	"",	//	ｶﾛｰﾗ ﾌｨｰﾙﾀﾞｰ
"NZE161G":	"",	//	ｶﾛｰﾗ ﾌｨｰﾙﾀﾞｰ
"NZE121":	"",	//	ｶﾛｰﾗ ﾗﾝｸｽ
"NZE124":	"",	//	ｶﾛｰﾗ ﾗﾝｸｽ
"NZE151N":	"",	//	ｶﾛｰﾗ ﾙﾐｵﾝ
"EL51":	"",	//	ｶﾛｰﾗ2
"AE109V":	"",	//	ｶﾛｰﾗV
"EE102V":	"",	//	ｶﾛｰﾗV
"NKE165":	"",	//	ｶﾛｰﾗｱｸｼｵ
"NRE160":	"",	//	ｶﾛｰﾗｱｸｼｵ
"NRE161":	"",	//	ｶﾛｰﾗｱｸｼｵ
"NZE141":	"",	//	ｶﾛｰﾗｱｸｼｵ
"NZE141ｶｲ":	"",	//	ｶﾛｰﾗｱｸｼｵ
"NZE144":	"",	//	ｶﾛｰﾗｱｸｼｵ
"NZE161":	"",	//	ｶﾛｰﾗｱｸｼｵ
"ZNE141":	"",	//	ｶﾛｰﾗｱｸｼｵ
"ZRE142":	"",	//	ｶﾛｰﾗｱｸｼｵ
"ZRE144":	"",	//	ｶﾛｰﾗｱｸｼｵ
"AE111N":	"",	//	ｶﾛｰﾗｽﾊﾟｼｵ
"NZE121N":	"",	//	ｶﾛｰﾗｽﾊﾟｼｵ
"ZZE122N":	"",	//	ｶﾛｰﾗｽﾊﾟｼｵ
"NKE165G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞ
"NZE121G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞ
"NZE141G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞ
"NZE144G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞ
"NZE161G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞ
"ZZE122G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞ
"NKE165G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞｰ
"NRE161G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞｰ
"NZE121G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞｰ
"NZE161G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞｰ
"NZE164G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞｰ
"ZRE142G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞｰ
"ZRE144G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞｰ
"ZRE162G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞｰ
"ZZE122G":	"",	//	ｶﾛｰﾗﾌｨｰﾙﾀﾞｰ
"NZE121G":	"",	//	ｶﾛｰﾗﾌｨﾙﾀﾞｰ
"NZE124G":	"",	//	ｶﾛｰﾗﾌｨﾙﾀﾞｰ
"NZE141G":	"",	//	ｶﾛｰﾗﾌｨﾙﾀﾞｰ
"NZE144G":	"",	//	ｶﾛｰﾗﾌｨﾙﾀﾞｰ
"NZE161G":	"",	//	ｶﾛｰﾗﾌｨﾙﾀﾞｰ
"NZE164G":	"",	//	ｶﾛｰﾗﾌｨﾙﾀﾞｰ
"ZRE142G":	"",	//	ｶﾛｰﾗﾌｨﾙﾀﾞｰ
"ZRE144G":	"",	//	ｶﾛｰﾗﾌｨﾙﾀﾞｰ
"ZZE122G":	"",	//	ｶﾛｰﾗﾌｨﾙﾀﾞｰ
"ZZE123G":	"",	//	ｶﾛｰﾗﾌｨﾙﾀﾞｰ
"ZZE124G":	"",	//	ｶﾛｰﾗﾌｨﾙﾀﾞｰ
"NZE124":	"",	//	ｶﾛｰﾗﾗﾝｸｽ
"ZZE122":	"",	//	ｶﾛｰﾗﾗﾝｸｽ
"ZZE124":	"",	//	ｶﾛｰﾗﾗﾝｸｽ
"NZE151N":	"",	//	ｶﾛｰﾗﾙﾐｵﾝ
"ZRE152N":	"",	//	ｶﾛｰﾗﾙﾐｵﾝ
"ZRE154N":	"",	//	ｶﾛｰﾗﾙﾐｵﾝ
"EE104G":	"",	//	ｶﾛｰﾗﾜｺﾞﾝ
"GRS180":	"",	//	ｸﾗｳﾝ
"GRS182":	"",	//	ｸﾗｳﾝ
"GRS184":	"",	//	ｸﾗｳﾝ
"GRS202":	"",	//	ｸﾗｳﾝ
"GRS204":	"",	//	ｸﾗｳﾝ
"GRS210":	"",	//	ｸﾗｳﾝ
"GS151":	"",	//	ｸﾗｳﾝ
"GS151H":	"",	//	ｸﾗｳﾝ
"GS171":	"",	//	ｸﾗｳﾝ
"GXS12":	"",	//	ｸﾗｳﾝ
"JZS151":	"",	//	ｸﾗｳﾝ
"JZS153ｶｲ":	"",	//	ｸﾗｳﾝ
"JZS155":	"",	//	ｸﾗｳﾝ
"JZS171":	"",	//	ｸﾗｳﾝ
"JZS130G":	"",	//	ｸﾗｳﾝ･ｽﾃｰｼｮﾝﾜｺﾞﾝ
"GWS204":	"",	//	ｸﾗｳﾝHV
"JZS171W":	"",	//	ｸﾗｳﾝｴｽﾃｰﾄ
"JZS173W":	"",	//	ｸﾗｳﾝｴｽﾃｰﾄ
"JZS175W":	"",	//	ｸﾗｳﾝｴｽﾃｰﾄ
"JZS175W":	"",	//	ｸﾗｳﾝｴｽﾃｰﾄ
"AWS210":	"",	//	ｸﾗｳﾝﾊｲﾌﾞﾘｯﾄﾞ
"GWS204":	"",	//	ｸﾗｳﾝﾊｲﾌﾞﾘｯﾄﾞ
"JZS149":	"",	//	ｸﾗｳﾝﾏｼﾞｪｽﾀ
"JZS155":	"",	//	ｸﾗｳﾝﾏｼﾞｪｽﾀ
"JZS177":	"",	//	ｸﾗｳﾝﾏｼﾞｪｽﾀ
"URS206":	"",	//	ｸﾗｳﾝﾏｼﾞｪｽﾀ
"UZS186":	"",	//	ｸﾗｳﾝﾏｼﾞｪｽﾀ
"UZS207":	"",	//	ｸﾗｳﾝﾏｼﾞｪｽﾀ
"KCH16W":	"",	//	ｸﾞﾗﾝﾄﾊｲｴｰｽ
"VCH16W":	"",	//	ｸﾞﾗﾝﾄﾊｲｴｰｽ
"KCH10W":	"",	//	ｸﾞﾗﾝﾄﾞﾊｲｴｰｽ
"VCH10W":	"",	//	ｸﾞﾗﾝﾄﾞﾊｲｴｰｽ
"VCH16W":	"",	//	ｸﾞﾗﾝﾄﾞﾊｲｴｰｽ
"KCH16W":	"",	//	ｸﾞﾗﾝﾄﾞﾊｲｴｰｽW
"KCH16W":	"",	//	ｸﾞﾗﾝﾋﾞｱ
"VCH10W":	"",	//	ｸﾞﾗﾝﾋﾞｱ
"ACU20W":	"",	//	ｸﾙｰｶﾞｰ
"ACU25W":	"",	//	ｸﾙｰｶﾞｰ
"MCU25W":	"",	//	ｸﾙｰｶﾞｰ
"ACU20W":	"",	//	ｸﾙｰｶﾞｰL
"ACU25W":	"",	//	ｸﾙｰｶﾞｰL
"ACU20W":	"",	//	ｸﾙｰｶﾞｰV
"ACU25W":	"",	//	ｸﾙｰｶﾞｰV
"MCU20W":	"",	//	ｸﾙｰｶﾞｰV
"MHU28W":	"",	//	ｸﾙｰｶﾞｰﾊｲﾌﾞﾘｯﾄﾞ
"GX100":	"",	//	ｸﾚｽﾀ
"JZX100":	"",	//	ｸﾚｽﾀ
"JZX100":	"",	//	ｸﾚｽﾀ
"HZB50":	"",	//	ｺｰｽﾀｰ
"RX4JFAT":	"",	//	ｺｰｽﾀｰ
"XZB50":	"",	//	ｺｰｽﾀｰ
"EL51":	"",	//	ｺﾙｻ
"AT170":	"",	//	ｺﾛﾅ
"AT190":	"",	//	ｺﾛﾅ
"AT211":	"",	//	ｺﾛﾅ
"AT211":	"",	//	ｺﾛﾅﾌﾟﾚﾐｵ
"ST210":	"",	//	ｺﾛﾅﾌﾟﾚﾐｵ
"TSS11":	"",	//	ｺﾝﾌｫｰﾄ
"AZK10":	"",	//	ｻｲ
"NCP160V":	"",	//	ｻｸｼｰﾄﾞ
"NCP51V":	"",	//	ｻｸｼｰﾄﾞ
"NCP55V":	"",	//	ｻｸｼｰﾄﾞ
"NCP58G":	"",	//	ｻｸｼｰﾄﾞ
"NCP59G":	"",	//	ｻｸｼｰﾄﾞ
"NCP55V":	"",	//	ｻｸｼｰﾄﾞ ﾊﾞﾝ
"NCP51V":	"",	//	ｻｸｼｰﾄﾞV
"NCP55V":	"",	//	ｻｸｼｰﾄﾞV
"NCP51V":	"",	//	ｻｸｼｰﾄﾞﾊﾞﾝ
"NCP58G":	"",	//	ｻｸｼｰﾄﾞﾜｺﾞﾝ
"NCP81G":	"",	//	ｼｪﾝﾀ
"NCP81Gｶｲ":	"",	//	ｼｴﾝﾀ
"NCP85G":	"",	//	ｼｴﾝﾀ
"NCP85G":	"",	//	ｼｪﾝﾀ
"NHP170G":	"",	//	ｼｴﾝﾀ
"NSP170G":	"",	//	ｼｴﾝﾀ
"D25":	"",	//	ｼｮﾍﾞﾙﾛｰﾀﾞｰ
"JZA70":	"",	//	ｽｰﾌﾟﾗ
"3SDK5":	"",	//	ｽｷｯﾄﾞﾛｰﾀﾞｰ
"4SDK6":	"",	//	ｽｷｯﾄﾞﾛｰﾀﾞｰ
"4SDK7":	"",	//	ｽｷｯﾄﾞﾛｰﾀﾞｰ
"SDKL6":	"",	//	ｽｷｯﾄﾞﾛｰﾀﾞｰ
"SGK4":	"",	//	ｽｷｯﾄﾞﾛｰﾀﾞｰ
"EP82":	"",	//	ｽﾀｰﾚｯﾄ
"EP91":	"",	//	ｽﾀｰﾚｯﾄ
"S231E":	"",	//	ｽﾊﾟｰｷｰ
"AE111N":	"",	//	ｽﾊﾟｼｵ
"NZE121N":	"",	//	ｽﾊﾟｼｵ
"AE110":	"",	//	ｽﾌﾟﾘﾝﾀｰ
"AE111G":	"",	//	ｽﾌﾟﾘﾝﾀｰｶﾘﾌﾞ
"AE114G":	"",	//	ｽﾌﾟﾘﾝﾀｰｶﾘﾌﾞ
"AE115G":	"",	//	ｽﾌﾟﾘﾝﾀｰｶﾘﾌﾞ
"NCP141":	"",	//	ｽﾍﾟｲﾄﾞ
"NSP140":	"",	//	ｽﾍﾟｲﾄﾞ
"NSP141":	"",	//	ｽﾍﾟｲﾄﾞ
"ZZT230":	"",	//	ｾﾘｶ
"ZZT231":	"",	//	ｾﾘｶ
"UCF20":	"",	//	ｾﾙｼｵ
"UCF21":	"",	//	ｾﾙｼｵ
"UCF30":	"",	//	ｾﾙｼｵ
"UCF31":	"",	//	ｾﾙｼｵ
"GZG50":	"",	//	ｾﾝﾁｭﾘｰ
"UZZ40":	"",	//	ｿｱﾗ
"EL51":	"",	//	ﾀｰｾﾙ
"BU102":	"",	//	ﾀﾞｲﾅ
"BU162":	"",	//	ﾀﾞｲﾅ
"KDY220":	"",	//	ﾀﾞｲﾅ
"KDY230":	"",	//	ﾀﾞｲﾅ
"TRY230":	"",	//	ﾀﾞｲﾅ
"XZU307":	"",	//	ﾀﾞｲﾅ
"XZU344":	"",	//	ﾀﾞｲﾅ
"XZU421":	"",	//	ﾀﾞｲﾅ
"XZU508V":	"",	//	ﾀﾞｲﾅ
"YY211":	"",	//	ﾀﾞｲﾅ
"LY280":	"",	//	ﾀﾞｲﾅ ﾄﾗｯｸ
"KDY231":	"",	//	ﾀﾞｲﾅﾄﾗｯｸ
"LY211":	"",	//	ﾀﾞｲﾅﾄﾗｯｸ
"RZU300":	"",	//	ﾀﾞｲﾅﾄﾗｯｸ
"TRY220":	"",	//	ﾀﾞｲﾅﾄﾗｯｸ
"XZU346":	"",	//	ﾀﾞｲﾅﾄﾗｯｸ
"XZU347":	"",	//	ﾀﾞｲﾅﾄﾗｯｸ
"XZU710":	"",	//	ﾀﾞｲﾅﾄﾗｯｸ
"KDY240V":	"",	//	ﾀﾞｲﾅﾙｰﾄﾊﾞﾝ
"CR52V":	"",	//	ﾀｳﾝｴｰｽ
"KM70":	"",	//	ﾀｳﾝｴｰｽ
"KR42V":	"",	//	ﾀｳﾝｴｰｽ
"YM60":	"",	//	ﾀｳﾝｴｰｽ
"SR40G":	"",	//	ﾀｳﾝｴｰｽ ﾉｱ
"SR50G":	"",	//	ﾀｳﾝｴｰｽ ﾉｱ
"CR30G":	"",	//	ﾀｳﾝｴｰｽ ﾜｺﾞﾝ
"KM51":	"",	//	ﾀｳﾝｴｰｽT
"CR42V":	"",	//	ﾀｳﾝｴｰｽV
"KR41V":	"",	//	ﾀｳﾝｴｰｽV
"KR42V":	"",	//	ﾀｳﾝｴｰｽV
"S402M":	"",	//	ﾀｳﾝｴｰｽV
"S412M":	"",	//	ﾀｳﾝｴｰｽV
"CM75":	"",	//	ﾀｳﾝｴｰｽﾄﾗｯｸ
"KM70":	"",	//	ﾀｳﾝｴｰｽﾄﾗｯｸ
"S402U":	"",	//	ﾀｳﾝｴｰｽﾄﾗｯｸ
"SR40G":	"",	//	ﾀｳﾝｴｰｽﾉｱ
"SR50G":	"",	//	ﾀｳﾝｴｰｽﾉｱ
"KR42V":	"",	//	ﾀｳﾝｴｰｽﾊﾞﾝ
"S402M":	"",	//	ﾀｳﾝｴｰｽﾊﾞﾝ
"M900A":	"",	//	ﾀﾝｸ
"GX100":	"",	//	ﾁｪｲｻｰ
"GX90":	"",	//	ﾁｪｲｻｰ
"GX90":	"",	//	ﾁｪｲｻｰ
"JZX100":	"",	//	ﾁｪｲｻｰ
"JZX105":	"",	//	ﾁｪｲｻｰ
"JZX90":	"",	//	ﾁｪｲｻｰ
"M100A":	"",	//	ﾃﾞｭｴｯﾄ
"KDY230":	"",	//	ﾄﾖｴｰｽ
"KDY281":	"",	//	ﾄﾖｴｰｽ
"RZU100":	"",	//	ﾄﾖｴｰｽ
"RZU300":	"",	//	ﾄﾖｴｰｽ
"TRY220":	"",	//	ﾄﾖｴｰｽ
"TRY230":	"",	//	ﾄﾖｴｰｽ
"XZU304":	"",	//	ﾄﾖｴｰｽ
"XZU348":	"",	//	ﾄﾖｴｰｽ
"XZU421":	"",	//	ﾄﾖｴｰｽ
"YY101":	"",	//	ﾄﾖｴｰｽ
"RZY230":	"",	//	ﾄﾖｴｰｽT
"JZS160":	"",	//	ﾄﾖﾀ
"JZS160":	"",	//	ﾄﾖﾀ
"NZE121":	"",	//	ﾄﾖﾀ
"NZE121":	"",	//	ﾄﾖﾀ
"7FBEL15":	"",	//	ﾄﾖﾀ ﾌｫｰｸﾘﾌﾄ
"7FB15":	"",	//	ﾄﾖﾀﾌｫｰｸﾘﾌﾄ
"8FG10":	"",	//	ﾄﾖﾀﾌｫｰｸﾘﾌﾄ
"SXN10":	"",	//	ﾅﾃﾞｨｱ
"AZR60G":	"",	//	ﾉｱ
"AZR65G":	"",	//	ﾉｱ
"SR50G":	"",	//	ﾉｱ
"ZRR70G":	"",	//	ﾉｱ
"ZRR70W":	"",	//	ﾉｱ
"ZRR75G":	"",	//	ﾉｱ
"ZRR80G":	"",	//	ﾉｱ
"ZRR80W":	"",	//	ﾉｱ
"ZWR80G":	"",	//	ﾉｱ
"223Bｶｲ":	"",	//	ﾊｲｴｰｽ
"KDH201V":	"",	//	ﾊｲｴｰｽ
"KDH205V":	"",	//	ﾊｲｴｰｽ
"KDH206K":	"",	//	ﾊｲｴｰｽ
"KDH206Kｶｲ":	"",	//	ﾊｲｴｰｽ
"KDH206V":	"",	//	ﾊｲｴｰｽ
"KDH206Vｶｲ":	"",	//	ﾊｲｴｰｽ
"KZH110G":	"",	//	ﾊｲｴｰｽ
"KZH116G":	"",	//	ﾊｲｴｰｽ
"LH113V":	"",	//	ﾊｲｴｰｽ
"LH119V":	"",	//	ﾊｲｴｰｽ
"LH178V":	"",	//	ﾊｲｴｰｽ
"LH186B":	"",	//	ﾊｲｴｰｽ
"RZH112V":	"",	//	ﾊｲｴｰｽ
"TRH200Kｶｲ":	"",	//	ﾊｲｴｰｽ
"TRH200K改":	"",	//	ﾊｲｴｰｽ
"TRH200V":	"",	//	ﾊｲｴｰｽ
"TRH216K":	"",	//	ﾊｲｴｰｽ
"TRH219W":	"",	//	ﾊｲｴｰｽ
"TRH226K":	"",	//	ﾊｲｴｰｽ
"KDH200V":	"",	//	ﾊｲｴｰｽV
"KDH201K":	"",	//	ﾊｲｴｰｽV
"KDH206V":	"",	//	ﾊｲｴｰｽV
"LH172V":	"",	//	ﾊｲｴｰｽV
"TRH102V":	"",	//	ﾊｲｴｰｽV
"TRH112V":	"",	//	ﾊｲｴｰｽV
"TRH200K":	"",	//	ﾊｲｴｰｽV
"TRH200V":	"",	//	ﾊｲｴｰｽV
"TRH211K":	"",	//	ﾊｲｴｰｽV
"KZH106W":	"",	//	ﾊｲｴｰｽW
"KZH110G":	"",	//	ﾊｲｴｰｽW
"LH80VH":	"",	//	ﾊｲｴｰｽｸｲｯｸﾃﾞﾘﾊﾞﾘｰ
"KDH223B":	"",	//	ﾊｲｴｰｽｺﾐｭｰﾀｰ
"KDH227Bｶｲ":	"",	//	ﾊｲｴｰｽｺﾐｭｰﾀｰ
"LH184B":	"",	//	ﾊｲｴｰｽｺﾐｭｰﾀｰ
"RZH125B":	"",	//	ﾊｲｴｰｽｺﾐｭｰﾀｰ
"KDH222B":	"",	//	ﾊｲｴｰｽｺﾐｭﾀｰ
"KDH200V":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"KDH201V":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"KDH206K":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"KDH221K":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"KZH138V":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"LH113V":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"LH119V":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"LH172V":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"LH178V":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"LH188K":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"RZH112V":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"TRH112V":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"TRH200K":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"TRH211K":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"TRH216K":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"TRH221K":	"",	//	ﾊｲｴｰｽﾊﾞﾝ
"KCH46G":	"",	//	ﾊｲｴｰｽﾚｼﾞｱｽ
"RCH42V":	"",	//	ﾊｲｴｰｽﾚｼﾞｱｽﾊﾞﾝ
"KZH100G":	"",	//	ﾊｲｴｰｽﾜｺﾞﾝ
"KZH106W":	"",	//	ﾊｲｴｰｽﾜｺﾞﾝ
"KZH120G":	"",	//	ﾊｲｴｰｽﾜｺﾞﾝ
"RZH101G":	"",	//	ﾊｲｴｰｽﾜｺﾞﾝ
"TRH214W":	"",	//	ﾊｲｴｰｽﾜｺﾞﾝ
"TRH219W":	"",	//	ﾊｲｴｰｽﾜｺﾞﾝ
"LN112":	"",	//	ﾊｲﾗｯｸｽ
"LN147":	"",	//	ﾊｲﾗｯｸｽ
"LN147":	"",	//	ﾊｲﾗｯｸｽT
"KZN185W":	"",	//	ﾊｲﾗｯｸｽｻｰﾌ
"RZN180W":	"",	//	ﾊｲﾗｯｸｽｻｰﾌ
"RZN185W":	"",	//	ﾊｲﾗｯｸｽｻｰﾌ
"RZN215W":	"",	//	ﾊｲﾗｯｸｽｻｰﾌ
"TRN210W":	"",	//	ﾊｲﾗｯｸｽｻｰﾌ
"TRN215W":	"",	//	ﾊｲﾗｯｸｽｻｰﾌ
"VZN215W":	"",	//	ﾊｲﾗｯｸｽｻｰﾌ
"RZN185W":	"",	//	ﾊｲﾗｯｸｽｻｰﾌW
"RZN215W":	"",	//	ﾊｲﾗｯｸｽｻｰﾌW
"VZN215W":	"",	//	ﾊｲﾗｯｸｽｻｰﾌW
"RZN174H":	"",	//	ﾊｲﾗｯｸｽｽﾎﾟｰﾂﾋﾟｯｸｱｯﾌﾟ
"KGC10":	"",	//	ﾊﾟｯｿ
"KGC15":	"",	//	ﾊﾟｯｿ
"KGC30":	"",	//	ﾊﾟｯｿ
"NGC30":	"",	//	ﾊﾟｯｿ
"QNC10":	"",	//	ﾊﾟｯｿ
"M502E":	"",	//	ﾊﾟｯｿ ｾｯﾃ
"M502E":	"",	//	ﾊﾟｯｿｾｯﾃ
"5FB10":	"",	//	ﾊﾞｯﾃﾘｰｼｷﾌｫｰｸﾘﾌﾄ
"5FB15":	"",	//	ﾊﾞｯﾃﾘｰｼｷﾌｫｰｸﾘﾌﾄ
"6FB15":	"",	//	ﾊﾞｯﾃﾘｰｼｷﾌｫｰｸﾘﾌﾄ
"7FB15":	"",	//	ﾊﾞｯﾃﾘｰｼｷﾌｫｰｸﾘﾌﾄ
"7FBL14":	"",	//	ﾊﾞｯﾃﾘｰｼｷﾌｫｰｸﾘﾌﾄ
"ACU10W":	"",	//	ﾊﾘｱｰ
"ACU30W":	"",	//	ﾊﾘｱｰ
"ACU35W":	"",	//	ﾊﾘｱｰ
"GSU30W":	"",	//	ﾊﾘｱｰ
"GSU31W":	"",	//	ﾊﾘｱｰ
"GSU35W":	"",	//	ﾊﾘｱｰ
"MCU15W":	"",	//	ﾊﾘｱｰ
"MCU30W":	"",	//	ﾊﾘｱｰ
"MCU35W":	"",	//	ﾊﾘｱｰ
"NCU10W":	"",	//	ﾊﾘｱｰ
"SXU10W":	"",	//	ﾊﾘｱｰ
"SXU15W":	"",	//	ﾊﾘｱｰ
"ZSU60W":	"",	//	ﾊﾘｱｰ
"AVU65W":	"",	//	ﾊﾘｱｰﾊｲﾌﾞﾘｯﾄﾞ
"S331M":	"",	//	ﾋﾟｸｼｽ
"LA300A":	"",	//	ﾋﾟｸｼｽｴﾎﾟｯｸ
"L575A":	"",	//	ﾋﾟｸｼｽｽﾍﾟｰｽ
"ZZV50":	"",	//	ﾋﾞｽﾀ
"NCP20":	"",	//	ﾌｧﾝｶｰｺﾞ
"NCP20ｶｲ":	"",	//	ﾌｧﾝｶｰｺﾞ
"NCP21":	"",	//	ﾌｧﾝｶｰｺﾞ
"NCP25":	"",	//	ﾌｧﾝｶｰｺﾞ
"NZE121G":	"",	//	ﾌｨｰﾙﾀﾞｰ
"NZE141G":	"",	//	ﾌｨｰﾙﾀﾞｰ
"ZZE122G":	"",	//	ﾌｨｰﾙﾀﾞｰ
"02-3FD35":	"",	//	ﾌｫｰｸﾘﾌﾄ
"02-5FD45":	"",	//	ﾌｫｰｸﾘﾌﾄ
"02-7FD15":	"",	//	ﾌｫｰｸﾘﾌﾄ
"02-7FD30":	"",	//	ﾌｫｰｸﾘﾌﾄ
"02-7FG15":	"",	//	ﾌｫｰｸﾘﾌﾄ
"02-7FG30":	"",	//	ﾌｫｰｸﾘﾌﾄ
"02-8FDL20":	"",	//	ﾌｫｰｸﾘﾌﾄ
"02-8FGL20":	"",	//	ﾌｫｰｸﾘﾌﾄ
"3FD25":	"",	//	ﾌｫｰｸﾘﾌﾄ
"3FD40":	"",	//	ﾌｫｰｸﾘﾌﾄ
"3FG15":	"",	//	ﾌｫｰｸﾘﾌﾄ
"3FG20":	"",	//	ﾌｫｰｸﾘﾌﾄ
"3FGL20":	"",	//	ﾌｫｰｸﾘﾌﾄ
"40-3FD50":	"",	//	ﾌｫｰｸﾘﾌﾄ
"40-5FG20":	"",	//	ﾌｫｰｸﾘﾌﾄ
"40-6FG25":	"",	//	ﾌｫｰｸﾘﾌﾄ
"4FGL15":	"",	//	ﾌｫｰｸﾘﾌﾄ
"52-8FD25":	"",	//	ﾌｫｰｸﾘﾌﾄ
"52-8FD30":	"",	//	ﾌｫｰｸﾘﾌﾄ
"5FD20":	"",	//	ﾌｫｰｸﾘﾌﾄ
"5FD25":	"",	//	ﾌｫｰｸﾘﾌﾄ
"5FD30":	"",	//	ﾌｫｰｸﾘﾌﾄ
"5FD35":	"",	//	ﾌｫｰｸﾘﾌﾄ
"5FD80":	"",	//	ﾌｫｰｸﾘﾌﾄ
"5FG25":	"",	//	ﾌｫｰｸﾘﾌﾄ
"5FGL20":	"",	//	ﾌｫｰｸﾘﾌﾄ
"5FGL25":	"",	//	ﾌｫｰｸﾘﾌﾄ
"6FD20":	"",	//	ﾌｫｰｸﾘﾌﾄ
"6FGL15":	"",	//	ﾌｫｰｸﾘﾌﾄ
"7FBRS18":	"",	//	ﾌｫｰｸﾘﾌﾄ
"7FD20":	"",	//	ﾌｫｰｸﾘﾌﾄ
"7FG25":	"",	//	ﾌｫｰｸﾘﾌﾄ
"80-3FDL15":	"",	//	ﾌｫｰｸﾘﾌﾄ
"80-3FDL20":	"",	//	ﾌｫｰｸﾘﾌﾄ
"FD45":	"",	//	ﾌｫｰｸﾘﾌﾄ
"NCP12":	"",	//	ﾌﾟﾗｯﾂ
"SCP11":	"",	//	ﾌﾟﾗｯﾂ
"RZJ125W":	"",	//	ﾌﾟﾗﾄﾞ
"NHW10":	"",	//	ﾌﾟﾘｳｽ
"NHW11":	"",	//	ﾌﾟﾘｳｽ
"NHW20":	"",	//	ﾌﾟﾘｳｽ
"ZVW35":	"",	//	ﾌﾟﾘｳｽ
"ZVW50":	"",	//	ﾌﾟﾘｳｽ
"ZVW51":	"",	//	ﾌﾟﾘｳｽ
"ZVW55":	"",	//	ﾌﾟﾘｳｽ
"NHW20":	"",	//	ﾌﾟﾘｳｽ HV
"ZVW41W":	"",	//	ﾌﾟﾘｳｽ ｱﾙﾌｧ
"ZVW35":	"",	//	ﾌﾟﾘｳｽPHV
"ZVW40W":	"",	//	ﾌﾟﾘｳｽｱﾙﾌｧ
"ZVW41W":	"",	//	ﾌﾟﾘｳｽｱﾙﾌｧ
"AZE154H":	"",	//	ﾌﾞﾚｲﾄﾞ
"AZE156H":	"",	//	ﾌﾞﾚｲﾄﾞ
"GRE156H":	"",	//	ﾌﾞﾚｲﾄﾞ
"JCG10":	"",	//	ﾌﾞﾚﾋﾞｽ
"JCG11":	"",	//	ﾌﾞﾚﾋﾞｽ
"JCG15":	"",	//	ﾌﾞﾚﾋﾞｽ
"AT210":	"",	//	ﾌﾟﾚﾐｵ
"AT211":	"",	//	ﾌﾟﾚﾐｵ
"AZT240":	"",	//	ﾌﾟﾚﾐｵ
"NZT240":	"",	//	ﾌﾟﾚﾐｵ
"NZT260":	"",	//	ﾌﾟﾚﾐｵ
"ST210":	"",	//	ﾌﾟﾚﾐｵ
"ST215":	"",	//	ﾌﾟﾚﾐｵ
"ZRT260":	"",	//	ﾌﾟﾚﾐｵ
"ZRT261":	"",	//	ﾌﾟﾚﾐｵ
"ZZT240":	"",	//	ﾌﾟﾚﾐｵ
"ZZT245":	"",	//	ﾌﾟﾚﾐｵ
"NCP50V":	"",	//	ﾌﾟﾛBOX V
"NCP51V":	"",	//	ﾌﾟﾛBOX V
"NCP58G":	"",	//	ﾌﾟﾛBOX W
"NCP55V":	"",	//	ﾌﾟﾛBOX-V
"JCG10":	"",	//	ﾌﾟﾛｸﾞﾚ
"JCG11":	"",	//	ﾌﾟﾛｸﾞﾚ
"MCX20":	"",	//	ﾌﾟﾛﾅｰﾄﾞ
"NCP165V":	"",	//	ﾌﾟﾛﾎﾞｯｸｽ
"NCP50V":	"",	//	ﾌﾟﾛﾎﾞｯｸｽ
"NCP51V":	"",	//	ﾌﾟﾛﾎﾞｯｸｽ
"NCP55V":	"",	//	ﾌﾟﾛﾎﾞｯｸｽ
"NCP58G":	"",	//	ﾌﾟﾛﾎﾞｯｸｽ
"NCP59G":	"",	//	ﾌﾟﾛﾎﾞｯｸｽ
"NLP51V":	"",	//	ﾌﾟﾛﾎﾞｯｸｽ
"NSP160V":	"",	//	ﾌﾟﾛﾎﾞｯｸｽ
"NCP55V":	"",	//	ﾌﾟﾛﾎﾞｯｸｽ ﾊﾞﾝ
"NCP50V":	"",	//	ﾌﾟﾛﾎﾞｯｸｽV
"NCP51V":	"",	//	ﾌﾟﾛﾎﾞｯｸｽV
"NCP58G":	"",	//	ﾌﾟﾛﾎﾞｯｸｽﾜｺﾞﾝ
"KSP92":	"",	//	ﾍﾞﾙﾀ
"NCP96":	"",	//	ﾍﾞﾙﾀ
"SDT40":	"",	//	ﾎｲﾙﾛｰﾀﾞｰ
"SDTL8":	"",	//	ﾎｲﾙﾛｰﾀﾞｰ
"NCP141":	"",	//	ﾎﾟﾙﾃ
"NCP145":	"",	//	ﾎﾟﾙﾃ
"NSP140":	"",	//	ﾎﾟﾙﾃ
"NSP141":	"",	//	ﾎﾟﾙﾃ
"NNP15":	"",	//	ﾎﾟﾙﾃ 3D
"ANA10":	"",	//	ﾏｰｸ X ｼﾞｵ
"GX100":	"",	//	ﾏｰｸ2
"GX110":	"",	//	ﾏｰｸ2
"GX115":	"",	//	ﾏｰｸ2
"GX90":	"",	//	ﾏｰｸ2
"JZX100":	"",	//	ﾏｰｸ2
"JZX100ｶｲ":	"",	//	ﾏｰｸ2
"JZX110":	"",	//	ﾏｰｸ2
"MCV21W":	"",	//	ﾏｰｸ2Wｸｵﾘｽ
"GX110W":	"",	//	ﾏｰｸ2ﾌﾞﾘｯﾄ
"JZX110W":	"",	//	ﾏｰｸ2ﾌﾞﾘｯﾄ
"JZX115W":	"",	//	ﾏｰｸ2ﾌﾞﾘｯﾄ
"GX115":	"",	//	ﾏｰｸII
"JZX110":	"",	//	ﾏｰｸII
"JZX110":	"",	//	ﾏｰｸⅡ
"JZX90":	"",	//	ﾏｰｸII
"GRX120":	"",	//	ﾏｰｸX
"GRX121":	"",	//	ﾏｰｸX
"GRX130":	"",	//	ﾏｰｸX
"GRX135":	"",	//	ﾏｰｸX
"ANA10":	"",	//	ﾏｰｸX ｼﾞｵ
"ANA10":	"",	//	ﾏｰｸXｼﾞｵ
"ANA15":	"",	//	ﾏｰｸXｼﾞｵ
"GGA10":	"",	//	ﾏｰｸXｼﾞｵ
"JZS155":	"",	//	ﾏｼﾞｪｽﾀ
"JZS177":	"",	//	ﾏｼﾞｪｽﾀ
"URS206":	"",	//	ﾏｼﾞｪｽﾀ
"UZS171":	"",	//	ﾏｼﾞｪｽﾀ
"UZS186":	"",	//	ﾏｼﾞｪｽﾀ
"CM60":	"",	//	ﾗｲﾄｴｰｽ
"KM51":	"",	//	ﾗｲﾄｴｰｽ
"KR42V":	"",	//	ﾗｲﾄｴｰｽ
"S412M":	"",	//	ﾗｲﾄｴｰｽ
"SR40G":	"",	//	ﾗｲﾄｴｰｽ ﾉｱ
"SR50G":	"",	//	ﾗｲﾄｴｰｽ ﾉｱ
"CM51":	"",	//	ﾗｲﾄｴｰｽﾄﾗｯｸ
"KM51":	"",	//	ﾗｲﾄｴｰｽﾄﾗｯｸ
"KM70":	"",	//	ﾗｲﾄｴｰｽﾄﾗｯｸ
"KM75":	"",	//	ﾗｲﾄｴｰｽﾄﾗｯｸ
"SR40G":	"",	//	ﾗｲﾄｴｰｽﾉｱ
"SR50G":	"",	//	ﾗｲﾄｴｰｽﾉｱ
"KR42V":	"",	//	ﾗｲﾄｴｰｽﾊﾞﾝ
"S402M":	"",	//	ﾗｲﾄｴｰｽﾊﾞﾝ
"EXZ10":	"",	//	ﾗｳﾑ
"NCZ20":	"",	//	ﾗｳﾑ
"NCZ25":	"",	//	ﾗｳﾑ
"NCP100":	"",	//	ﾗｸﾃｨｽ
"NCP100ｶｲ":	"",	//	ﾗｸﾃｨｽ
"NCP105":	"",	//	ﾗｸﾃｨｽ
"NCP120":	"",	//	ﾗｸﾃｨｽ
"NCP125":	"",	//	ﾗｸﾃｨｽ
"NSP120":	"",	//	ﾗｸﾃｨｽ
"NSP122":	"",	//	ﾗｸﾃｨｽ
"SCP100":	"",	//	ﾗｸﾃｨｽ
"SCP100ｶｲ":	"",	//	ﾗｸﾃｨｽ
"J200E":	"",	//	ﾗｯｼｭ
"J210E":	"",	//	ﾗｯｼｭ
"ACA21W":	"",	//	ﾗﾌﾞ4
"ACA31W":	"",	//	ﾗﾌﾞ4
"LJ78G":	"",	//	ﾗﾝｸﾙ ﾌﾟﾗﾄﾞ
"KZJ95W":	"",	//	ﾗﾝｸﾙﾌﾟﾗﾄﾞ
"VZJ120W":	"",	//	ﾗﾝｸﾙﾌﾟﾗﾄﾞ
"TRJ150W":	"",	//	ﾗﾝｸﾙﾌﾟﾗﾄﾞW
"HDJ81V":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰ
"URJ202W":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰ
"HDJ101K":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰ100
"UZJ100W":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰ100
"GRJ76K":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰ70
"GRJ79K":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰ70
"GRJ120W":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰﾌﾟﾗﾄﾞ
"GRJ121W":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰﾌﾟﾗﾄﾞ
"GRJ150W":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰﾌﾟﾗﾄﾞ
"KDJ120W":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰﾌﾟﾗﾄﾞ
"KZJ90W":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰﾌﾟﾗﾄﾞ
"KZJ95W":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰﾌﾟﾗﾄﾞ
"RZJ95W":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰﾌﾟﾗﾄﾞ
"TRJ150W":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰﾌﾟﾗﾄﾞ
"VZJ120W":	"",	//	ﾗﾝﾄﾞｸﾙｰｻﾞｰﾌﾟﾗﾄﾞ
"6FBRK13":	"",	//	ﾘｰﾁﾌｫｰｸﾘﾌﾄ
"TCR10G":	"",	//	ﾙｼｰﾀﾞ
"GRL10":	"",	//	ﾚｸｻｽ
"UVF46":	"",	//	ﾚｸｻｽ LS600h
"ZWA10":	"",	//	ﾚｸｻｽCT
"ZWA10":	"",	//	ﾚｸｻｽCT 200h
"GRS191":	"",	//	ﾚｸｻｽGS
"UZS190":	"",	//	ﾚｸｻｽGS
"GWS191":	"",	//	ﾚｸｻｽGS 450h
"GRS191":	"",	//	ﾚｸｻｽGS350
"URS190":	"",	//	ﾚｸｻｽGS460
"ANF10":	"",	//	ﾚｸｻｽHS 250h
"GSE20":	"",	//	ﾚｸｻｽIS
"GSE20":	"",	//	ﾚｸｻｽIS250
"UVF46":	"",	//	ﾚｸｻｽLS600hL
"AYZ15":	"",	//	ﾚｸｻｽNX300h
"AGL10W":	"",	//	ﾚｸｻｽRX
"RCH41W":	"",	//	ﾚｼﾞｱｽ
"RCH41W":	"",	//	ﾚｼﾞｱｽW
"KDH200V":	"",	//	ﾚｼﾞｱｽｴｰｽ
"KDH206V":	"",	//	ﾚｼﾞｱｽｴｰｽ
"KDH211K":	"",	//	ﾚｼﾞｱｽｴｰｽ
"LH178V":	"",	//	ﾚｼﾞｱｽｴｰｽ
"TRH200Kｶｲ":	"",	//	ﾚｼﾞｱｽｴｰｽ
"TRH200V":	"",	//	ﾚｼﾞｱｽｴｰｽ
"TRH226K":	"",	//	ﾚｼﾞｱｽｴｰｽ
"KDH200V":	"",	//	ﾚｼﾞｱｽｴｰｽV
"KDH201V":	"",	//	ﾚｼﾞｱｽｴｰｽV
"KDH205V":	"",	//	ﾚｼﾞｱｽｴｰｽV
"KDH206V":	"",	//	ﾚｼﾞｱｽｴｰｽV
"TRH200K":	"",	//	ﾚｼﾞｱｽｴｰｽV
"KDH200V":	"",	//	ﾚｼﾞｱｽｴｰｽﾊﾞﾝ
"KDH201V":	"",	//	ﾚｼﾞｱｽｴｰｽﾊﾞﾝ
"KDH205V":	"",	//	ﾚｼﾞｱｽｴｰｽﾊﾞﾝ
"RZH112V":	"",	//	ﾚｼﾞｱｽｴｰｽﾊﾞﾝ
"TRH200V":	"",	//	ﾚｼﾞｱｽｴｰｽﾊﾞﾝ
*/











var chassis = new Object;
var bet;
var cars = new Object;
var array = [];
var arrayh4 = [];
var arrayltp = [];
var arraylth4 = [];
var currenthtml;
var latesthtml;
var p;
var cmodel;
var mn;
var m;
var t;
var at;
var si;


cars = {
"AK12" : 8,//March



"DE3FS":15,//demio

"E11":13,
"GE6":13,


"K13":13,
"KGC10":8,//Passo

"KGC30":13,

"KSP90":15,//1000cc Vitz

"NCP51":35,//Succeed

"NCP58":28,//Succeed

"NCP81":30,//Succeed

"NCP100":30,

"NCZ20":40,

"NGC30":20,

"NNP10":23,//Porte

"SC11":25,//Tiida Latio
"C11":20,//Tiida
"SCP90":22,//Vitz
"SCP92":37,//Belta
"SCP100":35,//Ractis

"VY12":10,//AD

"Y12":27,//Wingroad

"ZVW30":36,
"ZVW40":46,

"ZVW41":50,

"ZGM10":30,
"ZRE142":52,//fielder

"NZE141":54,
"NZE151":35,
"GRX130":40,
"ZE2":23,
"ZGE20":40,
"CC25":24,
"C25":24,
"BL5FW":30,
"BL5FP":30,

"FD3":10
};


var mod;
var sp;
var nb;
var cf;
var clickable;

var list;
var listName;
askUser();

function askUser()
{
list = prompt("リストの文字を入力お願いします", "a,b,c or d");

if (list.length==1)
	{
	list = list.toUpperCase();
	 if (list=="A" || list=="B" || list=="C" || list=="D")
		{
		listName = list;
		 startLM();
		}
		else { askUser(); }
	}
	

}

function chassisFix(vcc)
{
	for (var k in cars)
	{
		if (vcc.indexOf(k)>=0)
		{
			return k;
		}

	}
}

function priceCheck(cm, i)
{
	
	sp = $(".startprice").eq(i).text();
	sp = sp.slice(0,sp.indexOf("."));
	
	//console.log(cm + " " + i);
	
	if (cars[cm]>=sp)
	{
		//console.log("It is cheaper than set price");
		return true;
	} else return false;
}




	
function startLM()
{
	
        currenthtml = window.location.href;
        latesthtml = window.location.href;
		clickable = $('input[value=' + listName + ']');
    	
	for (var i=0;i<clickable.length;i++)
	{
		mod = $(".type").eq(i).text();
		
		//nb = $("a[title='次へ→']").trigger("click");
		//console.log(mod.text() + " " + );
		cf = chassisFix(mod);
		//console.log(cf);
		if (priceCheck(cf, i))
				{
					if($('input[value=' + listName + ']')[i]) 
					{
					
					console.log(" cars added to list " + listName); 
					$('input[value=' + listName + ']')[i].click();
					
					}
				
				
				
			}
	}
	if ($("a[title='次へ→']").get(0)!=undefined)
	{
		$("a[title='次へ→']").get(0).click(function (e) {
e.stopPropagation();});

setTimeout(function(){checkPage();}, 3000);
	}
}

function checkPage()
{
	console.log("timeout 3 secs");
						latesthtml = window.location.href;
					
					if(currenthtml !== latesthtml) 
					{
							//console.log("startLM");
						startLM();
					}

}
